[{
  "_id": {
    "$oid": "60c8e0fde421674370c38b26"
  },
  "coursename": "Web Development",
  "coursenumber": 200,
  "courselevel": "Intermediate",
  "language": "English",
  "module_one_name": "Front-End Web Development Using HTML, CSS And Javascript",
  "description_one": "This course is designed to start you on a path toward future studies in web development and design, no matter how little experience or technical knowledge you currently have. The web is a very big place, and if you are the typical internet user, you probably visit several websites every day, whether for business, entertainment or education. But have you ever wondered how these websites actually work? How are they built? How do browsers, computers, and mobile devices interact with the web? What skills are necessary to build a website? With almost 1 billion websites now on the internet, the answers to these questions could be your first step toward a better understanding of the internet and developing a new set of internet skills.By the end of this course you’ll be able to describe the structure and functionality of the world wide web, create dynamic web pages using a combination of HTML, CSS, and JavaScript, apply essential programming language concepts when creating HTML forms, select an appropriate web hosting service, and publish your webpages for the world to see. Finally, you’ll be able to develop a working model for creating your own personal or business websites in the future and be fully prepared to take the next step in a more advanced web development or design course or specialization.",
  "pdf_one": "https://projectpdf.s3-ap-southeast-1.amazonaws.com/html-css-js-for-beginners.pdf",
  "video_one": "https://youtube.com/embed/5RIFrZEjURA",
  "module_two_name": "Server-side Development with NodeJS, Express and MongoDB",
  "description_two": "This course deals with all things server-side. We base the entire course around the NodeJS platform. We start with a brief overview of the Web protocols: HTTP and HTTPS. We examine NodeJS and NodeJS modules: Express for building web servers. On the database side, we review basic CRUD operations, NoSQL databases, in particular MongoDB and Mongoose for accessing MongoDB from NodeJS. We examine the REST concepts and building a RESTful API. We touch upon authentication and security. Finally we review backend as a service (BaaS) approaches, including mobile BaaS, both open-source and commercial BaaS services.At the end of this course, you will be able to Demonstrate an understanding of server-side concepts, CRUD and REST Build and configure a backend server using NodeJS framework Build a RESTful API for the front-end to access backend services.",
  "pdf_two": "https://project2pdf.s3-ap-southeast-1.amazonaws.com/Beginning+Node.js+And+MongoDB.pdf",
  "video_two": "https://youtube.com/embed/voDummz1gO0",
  "module_three_name": "Responsive Website Development and Design Capstone",
  "description_three": "The capstone will develop a professional-quality web portfolio. Students will demonstrate the ability to design and implement a responsive site for a minimum of three platforms. Adherence to validation and accessibility standards will be required. Upon completion of this course students will feel comfortable creating and/or updating existing front-end sites, utilizing existing frameworks, and testing sites for accessibility compliance.This course is only open to students who have completed the first two courses in the Web Development :Front-End Web Development Using HTML, CSS And Javascript and Server-side Development with NodeJS, Express and MongoDB.",
  "pdf_three": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/RESTful_Web_API_Design_with_Node_js.pdf",
  "video_three": "https://youtube.com/embed/1NrHkjlWVhM",
  "m1begs1": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/html%2Ccss/HTML+and+CSS+Beginner.pdf",
  "m1begs2": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/html%2Ccss/Learn+to+Code+HTML+and+CSS+Beginner.pdf",
  "m1advs1": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/html%2Ccss/The+Complete+Reference+HTML+_.pdf",
  "m1advs2": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/html%2Ccss/Beginning+HTML%2C+XHTML%2C+CSS+and+JavaScript_.pdf",
  "m2begs1": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/mongodb/PDF-Guide-Node-Andrew-Mead-v3.pdf",
  "m2begs2": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/mongodb/mdb+Beginner.pdf",
  "m2advs1": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/mongodb/Node.js_in_Action_(2014).pdf",
  "m2advs2": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/mongodb/mdb+Advanced.pdf",
  "m3finals1": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/final/Web_Development_with_Node_Express.pdf",
  "m3finals2": "https://myfilespdf.s3.ap-southeast-1.amazonaws.com/final/mongodb_final.pdf",
  "__v": 0
},{
  "_id": {
    "$oid": "60c9b50ab482001a98f6e691"
  },
  "coursename": "Programming Using Python",
  "coursenumber": 201,
  "courselevel": "Intermediate",
  "language": "English",
  "module_one_name": "Python Basics And Data Structures",
  "description_one": "This module aims to teach everyone the basics of programming computers using Python. We cover the basics of how one constructs a program from a series of simple instructions in Python. This module will also introduce the core data structures of the Python programming language. We will move past the basics of procedural programming and explore how we can use the Python built-in data structures such as lists, dictionaries, and tuples to perform increasingly complex data analysis.",
  "pdf_one": "https://mypythonfile.s3.ap-southeast-1.amazonaws.com/python/Python-Programming1.pdf",
  "video_one": "https://youtube.com/embed/kQDxmjfkIKY",
  "module_two_name": "Using Python to Access Web Data",
  "description_two": "This module will show how one can treat the Internet as a source of data.  We will scrape, parse, and read web data as well as access data using web APIs.  We will work with HTML, XML, and JSON data formats in Python.",
  "pdf_two": "https://mypythonfile.s3.ap-southeast-1.amazonaws.com/python/python_web_scraping2.pdf",
  "video_two": "https://youtube.com/embed/XVv6mJpFOb0",
  "module_three_name": "Using Databases with Python",
  "description_three": "This course will introduce students to the basics of the Structured Query Language (SQL) as well as basic database design for storing data as part of a multi-step data gathering, analysis, and processing effort. The course will use SQLite3 as its database.  We will also build web crawlers and multi-step data gathering and visualization processes.  We will use the D3.js library to do basic data visualization.",
  "pdf_three": "https://mypythonfile.s3.ap-southeast-1.amazonaws.com/python/python_database_access3.pdf",
  "video_three": "https://youtube.com/embed/byHcYRpMgI4",
  "m1begs1": "https://mypythonfile.s3.ap-southeast-1.amazonaws.com/python/module1/thinkpython.pdf",
  "m1begs2": "https://mypythonfile.s3.ap-southeast-1.amazonaws.com/python/module1/Data+Structures+and+Algorithms+Using+Python.pdf",
  "m1advs1": "https://mypythonfile.s3.ap-southeast-1.amazonaws.com/python/module1/Fundamentals_of_Pythonadv.pdf",
  "m1advs2": "https://mypythonfile.s3.ap-southeast-1.amazonaws.com/python/module1/fullbookadv.pdf",
  "m2begs1": "https://mypythonfile.undefined/python/module2/website-scraping-with-python.pdf",
  "m2begs2": "https://mypythonfile.undefined/python/module2/PyWebScrapingBook.pdf",
  "m2advs1": "https://mypythonfile.undefined/python/module2/Python+Web+Scraping+Cookbook_adv).pdf",
  "m2advs2": "https://mypythonfile.undefined/python/module2/pythonlearn_adv.pdf",
  "m3finals1": "https://mypythonfile.undefined/python/module3/Python+-+Database+Application+Programming+Interface.pdf",
  "m3finals2": "https://mypythonfile.undefined/python/module3/connector-python-en.a4.pdf",
  "__v": 0
}]